{"title": "Apple Watch Series 9 and Watch Ultra 2 Sales Halted in the US Due to Patent Dispute", "date": "2023-12-23", "tags": ["Apple Watch", "Patent Dispute", "Masimo", "Health Tech", "Blood Oxygen Monitoring"], "title_image": "Apple-Watch-Series-9-and-Watch-Ultra-2-Sales-Halted-in-the-US-Due-to-Patent-Dispute", "description": "Apple has stopped the online sale of its Apple Watch Series 9 and Watch Ultra 2 in the US due to a patent dispute with health tech company Masimo. Learn more about the details of the dispute and the impact on customers.", "content": [{"heading": "The Patent Dispute", "image": "Apple-Watch-Series-9-and-Watch-Ultra-2-Patent-Dispute", "content": "The patent dispute between Apple and Masimo revolves around the blood oxygen monitoring technology used in the Apple Watch Series 9 and Watch Ultra 2. Masimo claims that Apple infringed on its patents related to this technology, leading to the US International Trade Commission ordering Apple to stop selling the watches in question in the US. This has resulted in Apple voluntarily removing the watches from its website and planning to cease sales in retail stores starting December 24."}, {"heading": "Impact on Customers", "image": "Apple-Watch-Series-9-and-Watch-Ultra-2-Impact-on-Customers", "content": "With the halt in sales of the Apple Watch Series 9 and Watch Ultra 2, customers in the US will no longer be able to purchase these models online or in retail stores. This could lead to disappointment for individuals who were looking forward to acquiring these advanced smartwatches, especially during the holiday season. However, Apple is actively pursuing legal and technical options to ensure that the watches remain available to customers, indicating a potential resolution in the future."}, {"heading": "Legal and Technical Options", "image": "Apple-Watch-Series-9-and-Watch-Ultra-2-Legal-and-Technical-Options", "content": "In response to the patent dispute and the subsequent order to halt sales, Apple is exploring various legal and technical avenues to address the situation. This includes engaging in legal proceedings to defend its position and potentially negotiate with Masimo for a resolution. Additionally, Apple may be working on implementing alternative technologies or workarounds to ensure that the blood oxygen monitoring feature remains available in the affected Apple Watch models, even if modifications are required."}, {"heading": "Import Ban and Presidential Review", "image": "Apple-Watch-Series-9-and-Watch-Ultra-2-Import-Ban-and-Presidential-Review", "content": "While the import ban on the Apple Watch Series 9 and Watch Ultra 2 is set to take effect on December 26, there is a pending presidential review that could influence the situation. This review period allows for further examination of the dispute and its implications, potentially leading to adjustments in the enforcement of the ban. As a result, the availability of the watches in the US may be subject to changes based on the outcome of the review process."}, {"heading": "Looking Ahead", "image": "Apple-Watch-Series-9-and-Watch-Ultra-2-Looking-Ahead", "content": "As the patent dispute between Apple and Masimo unfolds, it is essential for customers and industry observers to stay informed about the developments and potential resolutions. The impact of this dispute extends beyond the availability of specific Apple Watch models, as it also highlights the significance of intellectual property rights and technological innovation in the wearable tech sector. By monitoring the progress of legal proceedings and technical advancements, stakeholders can gain insights into the future availability and features of the Apple Watch Series 9 and Watch Ultra 2 in the US market."}]}